{
  "blogs": [
    {
      "title": "Series review: Nancy Drew",
      "body": "In a roundabout way, “Twin Peaks” may be the most influential show in today’s teen TV. It’s roundabout because it’s not actually “Twin Peaks,” David Lynch’s brilliant, flawed soap opera about trauma, Americana, and, ultimately, itself that’s doing the influencing. The CW’s “Riverdale,” loosely based on the Archie Comics series, cracked the code that what people wanted was a show that had Twin Peaks flavor — small-town quirk, winking awareness of its own outsizedness, affected nostalgia existing right next door to cynical contemporaneity — even if it wasn’t interested in, and couldn’t achieve, actual Lynch.In borrowing from “Riverdale,” the new CW series “Nancy Drew” is borrowing from this imaginary “Twin Peaks.” Like its network-mate, it is leveraging an intellectual property known for its squareness and pumping it with raunch and an overstated air of enigma. Which wouldn’t matter if it were interesting. But “Nancy Drew” isn’t just dull, it has the misfortune of following another dull show that is much like it. Here, the milieu is slightly aged up from “Riverdale” — Kennedy McMann plays a young woman who ought, according to her life plan, to be in college, but who tanked her classes after the death of her mother and who is now stuck at home. We meet her, in a voice-over that attempts to mask just how much narrative work it has to do with a sort of breezy, over-it attitude, in an assignation with Ned Nickerson (who is, in the mystery book series that began in 1930, Nancy’s nice-guy boyfriend). As with so much else here, it feels like a basely obvious attempt to get attention for edge and transgressiveness where little really exists: If a CW show not based on a book series known for its appropriateness for young girl early readers began with a sex scene, would anyone care? “Nancy Drew” gets its jolt from the fact that it depicts Nancy Drew, a character even those unfamiliar likely perceive as prudish thanks to its time period and to a kiddie-film Emma Roberts adaptation from a decade ago. It’s a cheap and unearned bit of electricity, and one that tapers off as it becomes increasingly clear that “Nancy Drew’s” vision for how to modify its main character and her world extend no further than, well, “Riverdale,” with a central mystery rooted in the supernatural and with a socialite victim that both feel borrowed from the spooky and rigorously class-stratified world elsewhere on the CW’s air. Given the degree to which “Nancy Drew” attempts to coast by on sheer attitude, it should come as no surprise that the mystery is fundamentally uninteresting and that Nancy’s friends, in the show’s first two hours, are undistinguished. The show is less a series with characters and plot than an attempt at a haunted mood. It may get there at times by sheer, relentless effort. But unlike the best of TV, including its second-degree influences, “Nancy Drew” won’t haunt you for even a moment after the episode ends. ",
      "author": "Admin-two",
      "series_review": "*****",
      "id": 1
    },
    {
      "title": "Welcome to the new blog!",
      "body": "Welcome to our new blog. This blog is for all lovers of good series. Feel free to post your review!!",
      "author": "Admin-one",
      "series_review": "*****",
      "id": 2
    }
  ]
}